app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "asdsadassadas"], ["body", "asdsadsadsadaadssad"], ["updated_at", "2019-11-26 01:02:00.932621"], ["id", 12]]
---
      def update
        @article = Article.find(params[:id])
        @article.update(article_params)